Ran Plan for 9 projects:

1. dir: `infra/us-east-1/dev/rds/security-group` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/cluster` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
1. dir: `infra/us-east-1/dev/vpc` workspace: `default`
1. dir: `infra/us-east-1/dev/rds/subnet-group` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `default`
1. dir: `infra/us-east-1/mgmt/peering/dev` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`

### 1. dir: `infra/us-east-1/dev/rds/security-group` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/rds/security-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Frds%252Fsecurity-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/rds/security-group`

---
### 2. dir: `infra/us-east-1/dev/eks/cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_eks_addon.this["kube-proxy"],
│   on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
│  392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│ 
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
│ 
│ (and 2 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fcluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/cluster`
</details>
No changes. Your infrastructure matches the configuration.

---
### 3. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/honeycomb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fhoneycomb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/honeycomb`

---
### 4. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # kubectl_manifest.addons["addons/crossplane.yaml"] will be updated in-place
!   resource "kubectl_manifest" "addons" {
        id                      = "/apis/core.oam.dev/v1beta1/namespaces/vela-system/applications/addon-crossplane"
        name                    = "addon-crossplane"
!       yaml_body               = (sensitive value)
!       yaml_body_parsed        = <<-EOT
            apiVersion: core.oam.dev/v1beta1
            kind: Application
            metadata:
              name: addon-crossplane
              namespace: vela-system
            spec:
              components:
              - name: crossplane
                properties:
                  chart: crossplane
                  repoType: helm
                  url: https://charts.crossplane.io/stable
                  values:
                    extraObjects:
                    - apiVersion: pkg.crossplane.io/v1alpha1
                      kind: ControllerConfig
                      metadata:
                        annotations:
                          eks.amazonaws.com/role-arn: arn:aws:iam::677160962006:role/CrossPlaneAddonRole
                          helm.sh/hook: post-install
                        name: aws-config
                      spec:
                        podSecurityContext:
                          fsGroup: 2000
                    - apiVersion: pkg.crossplane.io/v1
                      kind: Provider
                      metadata:
                        annotations:
                          helm.sh/hook: post-install
                        name: provider-aws
                      spec:
                        controllerConfigRef:
                          name: aws-config
                        package: xpkg.upbound.io/crossplane-contrib/provider-aws:v0.45.2
                    replicas: 1
+                   resourcesCrossplane:
+                     limits:
+                       cpu: 500m
+                       memory: 512Mi
                  version: 1.14.0
                type: helm
              - name: crossplane-provider-config
                properties:
                  objects:
                  - apiVersion: aws.crossplane.io/v1beta1
                    kind: ProviderConfig
                    metadata:
                      name: aws-provider
                    spec:
                      credentials:
                        source: InjectedIdentity
                type: k8s-objects
              workflow:
                steps:
                - name: apply-crossplane
                  properties:
                    component: crossplane
                  type: apply-component
                - name: wait-crds
                  properties:
                    duration: 3m
                  type: suspend
                - name: apply-crossplane-config
                  properties:
                    component: crossplane-provider-config
                  type: apply-component
        EOT
        # (13 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fkubevela-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/kubevela-addons`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 5. dir: `infra/us-east-1/dev/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_subnet_group.database[0] will be created
+   resource "aws_db_subnet_group" "database" {
+       arn                     = (known after apply)
+       description             = "Database subnet group for scde-dev-us-east-1"
+       id                      = (known after apply)
+       name                    = "dev-subnet-group"
+       name_prefix             = (known after apply)
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags                    = {
+           "Name" = "dev-subnet-group"
        }
+       tags_all                = {
+           "Environment"  = "dev"
+           "Name"         = "dev-subnet-group"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                  = (known after apply)
    }

  # aws_route_table_association.database[0] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[1] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[2] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_subnet.database[0] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.108.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

  # aws_subnet.database[1] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.112.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

  # aws_subnet.database[2] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.116.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1c"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1c"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!   database_route_table_association_ids        = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
!   database_subnet_arns                        = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   database_subnet_group                       = (known after apply)
+   database_subnet_group_name                  = "dev-subnet-group"
!   database_subnets                            = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
!   database_subnets_cidr_blocks                = [
+       "10.50.108.0/22",
+       "10.50.112.0/22",
+       "10.50.116.0/22",
    ]
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/vpc`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
### 6. dir: `infra/us-east-1/dev/rds/subnet-group` workspace: `default`
```diff
module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/rds/subnet-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Frds%252Fsubnet-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/rds/subnet-group`

---
### 7. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/cluster-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fcluster-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/cluster-addons`

---
### 8. dir: `infra/us-east-1/mgmt/peering/dev` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/peering/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fpeering%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/peering/dev`

---
### 9. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.gh-oauth[0] will be created
+   resource "kubectl_manifest" "gh-oauth" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "gh-oauth"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: gh-oauth
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.iohk-ghcr-creds[0] will be created
+   resource "kubectl_manifest" "iohk-ghcr-creds" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "iohk-ghcr-creds"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: iohk-ghcr-creds
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.jwt-signature[0] will be created
+   resource "kubectl_manifest" "jwt-signature" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "jwt-signature"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: jwt-signature
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/eks/green/kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Feks%252Fgreen%252Fkubevela-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/eks/green/kubevela-addons`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`